/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   strlen.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: nhwang <nhwang@student.42seoul.kr>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/12/09 10:30:43 by nhwang            #+#    #+#             */
/*   Updated: 2021/12/17 13:00:03 by nhwang           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//타입 정의랑 함수의 구현부 등 전부 따로빼는 작업이 필요함

#include "libft.h"

size_t	ft_strlen(const char *str)
{
	const char	*ch;
	size_t		cnt;

	cnt = 0;
	ch = str;
	while (*ch)
	{
		cnt++;
		ch++;
	}
	return (cnt);
}
